#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_service_account.ci-terraform: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-terraform@url-generator-438113.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github-wif-pool: Refreshing state... [id=projects/url-generator-438113/locations/global/workloadIdentityPools/github-wif]
google_service_account.ci-lilurl: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-lilurl@url-generator-438113.iam.gserviceaccount.com]
google_storage_bucket.tf-state-bucket: Refreshing state... [id=tf-state-bucket-438113]
google_project_iam_member.project-owner: Refreshing state... [id=url-generator-438113/roles/owner/serviceAccount:ci-terraform@url-generator-438113.iam.gserviceaccount.com]
google_service_account_iam_member.lilurl-iac-wiu: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-terraform@url-generator-438113.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/564701988502/locations/global/workloadIdentityPools/github-wif/attribute.repository/pansachin/lilurl-iac]
google_project_iam_member.lilurl-access: Refreshing state... [id=url-generator-438113/roles/compute.admin/serviceAccount:ci-lilurl@url-generator-438113.iam.gserviceaccount.com]
google_service_account_iam_member.lilurl-wiu: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-lilurl@url-generator-438113.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/564701988502/locations/global/workloadIdentityPools/github-wif/attribute.repository/pansachin/lilurl]
google_iam_workload_identity_pool_provider.github-provider: Refreshing state... [id=projects/url-generator-438113/locations/global/workloadIdentityPools/github-wif/providers/github-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.lilurl will be created
  + resource "google_artifact_registry_repository" "lilurl" {
      + create_time      = (known after apply)
      + description      = "Lilurl repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "url-generator-438113"
      + repository_id    = "lilurl"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pansachin, Action: `pull_request`, Workflow: `Plan & Apply`*